{
  "ACCC Insurance": {
    "name_of_reviewer": null,
    "review_1": "Affordable insurance!",
    "star_1": 4,
    "review_2": "They refused to fix my car, and said its a total loss.. their policy holder hit my parked car, the damage was so minimal, now i am suing their policy holder... with this insurance ... you are not really insured..... at the end you did not save any money at all with their cheap rate....",
    "star_2": 1,
    "review_3": "Worst company, I asked for my accident report two day s ago, I will be filing a report with better business bureau tomorrow.",
    "star_3": 4
  },
  "American Family": {
    "name_of_reviewer": null,
    "review_1": "afreems10 Car insurance review American Family Insurance is amazing. They are so much cheaper than some of the larger insurance agencies in the US, but their prices are comparable to GEICO. My agent said that much of this is attributable to the fact that they have a smaller service area and they do not cover individuals who are higher risk. I have a personal relationship with my agent and she is fantastic.",
    "star_1": 5,
    "review_2": "Car insurance review I think they are good so far, I can’t wait to get the decrease in insurance payment at the age of 25. Just 6 more years to go!",
    "star_2": 5,
    "review_3": "KatieM Car insurance review Good service always! very friendly, easy to work with, available to anser all my quesitions, very profesional .",
    "star_3": 5
  },
  "Grange Mutual": {
    "name_of_reviewer": "Cyndy",
    "review_1": "Always have reasonable rates prices and deductibles. Always been suitable and affordable. I’ve never had an accident but my rate has never went up either.",
    "star_1": 5,
    "review_2": "easy to deal with. you can call tehm whenever you have a question or stop by the office. you can also pay online yearly, which a lot of companies don’t do any longer. love the convenience and how they handle problems like accidents.",
    "star_2": 5,
    "review_3": "All dealings I have had with this company have been positive. Great rates and great communication. Renewal is very easy.",
    "star_3": 5
  },
  "National Grange Mutual": {
    "name_of_reviewer": "Cyndy",
    "review_1": "Always have reasonable rates prices and deductibles. Always been suitable and affordable. I’ve never had an accident but my rate has never went up either.",
    "star_1": 5,
    "review_2": "easy to deal with. you can call tehm whenever you have a question or stop by the office. you can also pay online yearly, which a lot of companies don’t do any longer. love the convenience and how they handle problems like accidents.",
    "star_2": 5,
    "review_3": "All dealings I have had with this company have been positive. Great rates and great communication. Renewal is very easy.",
    "star_3": 5
  },
  "Atlantic States Insurance": {
    "name_of_reviewer": "Klalala",
    "review_1": "Atlantic States has been our insurance provider for a couple years. They have provided us with excellent service. I needed a windshield replaced and it was very easy to claim and have the glasswork completed.",
    "star_1": 5,
    "review_2": "I was a member of this company for two years, during which I had bought a car used. Almost year later, it was totaled in an accident caused by another driver and I was not able to receive a proper return to cover the damages due to problems involving the two statements I gave about the incident. The first occurred directly after and I had been knocked out during the accident so my recollection wasn’t entirely clear. The second was taken a few days later.",
    "star_2": 3,
    "review_3": "Very nice people, but the prices were a little out of my price range. I was able to find a company with cheaper rates. I wish they could have matched it.",
    "star_3": 5
  },
  "Bristol West": {
    "name_of_reviewer": "saveone83",
    "review_1": "Bristol West Insurance isn’t the best, but it isn’t the biggest rip off. I used them very briefly for auto insurance, didn’t make any claims. I was first given a price, monthly, for the first payment -- and it was raised for evidently no reason. By the time the second came, it raised yet again 20 more dollars. Another 25 was added by my third time paying. They told me they would enable auto pay, despite my explanation to them via phone and email that I do not prefer auto pay. The payment continued to rise. While this IS terrible, they did profusely apologize and offer a -partial- refund, which I did end up accepting.",
    "star_1": null,
    "review_2": "This insurance is awesome! I needed insurance immediately and got the lowest rate from them. And my agent is really great!",
    "star_2": 5,
    "review_3": "This was the cheapest insurance I could fine for what I needed. I needed to have deer insurance because that is how I lost my last vehicle and everywhere else was so expensive but Bristol West was affordable. However, when my 6 months was done, I didn’t receive any communication to renew my insurance and my account was charged but I had already switched to another insurance and so far it’s taken months to get the money back and then I only get half back. I’m still sending in screenshots and scans of documents and they keep saying to resend what I already sent. So, fast forward 5 months later I’m still waiting to receive the rest of the money.",
    "star_3": 4
  },
  "Clearcover": {
    "name_of_reviewer": "RichardA323",
    "review_1": "Clearcover is not a well known insurance carrier and many people do know recognize the name, however they offered me the cheapest insurance policy for my 2016 Honda Civic. It was better than Progressive or Geico (my previous carriers). I found Clearcover through gaby.com which helped me get the policy set up and I am still insured with this company. Fortunately, I did not have to open any claims since I became a customer and cannot review their claim process but it seems that it can be done online fairly easily.",
    "star_1": 5,
    "review_2": "Clearcover has cheap policy’s however I worry now of payout if something was to happen. Absolutely the hardest company to contact and when you do contact they are clueless. Have to contact by email to be able to speak with person. Company does not impress me what so ever will be changing asap",
    "star_2": 2,
    "review_3": "I used to have Clearcover Insurance but make the decision to switch last year. I was rear ended by a drunk driver and the process was fairly smooth in regards to claim process and getting my vehicle back on the road in about 45 days. The part I did not like is that you don’t get back your deductible even if your are not at fault like other insurances. I would not recommend based on what you actual save when you factor your deductible which mine was $1500 loss",
    "star_3": 1
  },
  "Rural Mutual Insurance": {
    "name_of_reviewer": null,
    "review_1": "Coverage is great, but the customer service I have received has been low for my standards. They usually are late in getting back to me or making updates to my policy as requested.",
    "star_1": 5,
    "review_2": "The local, personal service is nice! I can call or just stop by the office and they know who I am. Prices are very competitive too. Adding or removing a vehicle is very easy.",
    "star_2": 5,
    "review_3": "They are a very good insurance company",
    "star_3": 5
  },
  "Allmerica": {
    "name_of_reviewer": null,
    "review_1": "David of Oklahoma City\nNEW INVOICE FEES! Every time they send an invoice, even at inception with the declaration pages, Hanover will charge you an \"INVOICE FEE\". Apparently they will stop at nothing to extract a few extra dollars, even from long term customers and those who pay the full premium up front. Never been treated so badly even by customer service also. They seem to be fine with pissing-off their paying customers.",
    "star_1": 1,
    "review_2": "I have requested my coverage Agency respond to my inquiry regarding the outrageous premium that I am being charged. I requested/received a copy of my LexisNexis report which contained 3 entries. (1) 5 mph over speeding ticket in 2017, (2) A comprehensive claim for $282 dated 8/19/16 which I would not have made had my agent not told me that it didn’t count against you, and (3) An accident (I was not the driver) from Jan 2014-over 5 years old. After speaking with LexisNexis regarding this report I inquired 3 x’s if they did the scoring and was told no...these calls are recorded so I must assume that this is the truth. I have made repeated requests to my Agent for \"the insurance score\" and have been given the runaround and no information.",
    "star_2": 1,
    "review_3": "K. of Somers\nFlooded basement on Friday night. Noticed it Saturday and called Hanover Insurance Company. Was called back later in the day. They left a message. I followed up Sunday morning and claim representative asked some questions and said adjuster would call Monday. Monday it was 11:30 still no call. I called adjuster and he said they don’t come onsite and local remediation company would be onsite. Later Monday remediation company came out and just did a walk around. No suggestion to immediately start a outright cleanup to prevent mold, mildew or bacteria not even dehumidifiers. Heard nothing back that day. Called Adjuster Tuesday and he has the day off.",
    "star_3": 1
  },
  "Amica Insurance": {
    "name_of_reviewer": "Beemonster",
    "review_1": "During a snow squall I rear-ended another vehicle this winter. No one was injured and my vehicle wasn’t really damaged. The other party did choose to file a claim. An Amica representative called us to verify the details of the accident and about 10 days later called to let us know that they would be paying out $900 for damage. We haven’t had to renew our policy since then, but this experience was that they were very easy to deal with and prompt.",
    "star_1": 5,
    "review_2": "I Never leave reviews but I thought Id post one on how amica has treated me on a recent car accident claim to give a future customer on how they can expect to be treated. First of all this claim has been going on for 3 months now and is still not resolved. I have contacted customer serivice with no response back. The customer service is the worst, plan on them not getting back to you untill they are ready to. The company just takes your money for your insurance payment and when you actually need them they are no where to be found. I have been interragated and put through so much unnessicary stress by their company. and when you ask them for an update you get no response back. The company has no respect for your personal life and do not treat their customers like human beings. Stay away from this insurance company to avoid future head aches, when you call to get a policy they are nothing but nice to you but when you actually need them plan on jumping through hoops for them. Go with a different company. This is not the one",
    "star_2": 1,
    "review_3": "Amica is a great company, ive been with them for years and have never had an issue. I’ve needed to call and talk to an agent a handful of times and every time they’ve been very friendly and helpful.",
    "star_3": 5
  },
  "Motorists Mutual": {
    "name_of_reviewer": "Tatiana Ebert",
    "review_1": "Easily the worst experience I’ve had with an insurance company. After years of paying premiums, they treated me like a burden rather than a customer. They were slow to respond throughout the process and required me to get documents such as accident reports despite my injuries. I will not be doing business with them any longer.",
    "star_1": 1,
    "review_2": "Do you like paying double what you should be paying for auto and home? Do you enjoy paying your hard earned money to a company that makes it incredibly inconvenient to cancel. This is the company for anyone looking for a high blood pressure low value experience! Took over a week to finally send an adjustor to look at a vehicle 2 days longer to cut a check for repair. Can never find my policy when I call. Now to add insult to injury they require a hand written cancellation letter with each policy # and date you request termination MAILED to their headquarters... Sounds like a great way to steal a couple more dollars from me until my letter arrives. Company is outdated and overpriced.",
    "star_2": 1,
    "review_3": "I am speechless. We received a letter with a notice of cancellation and a credit for unused premium although we have NEVER been with them. In addition that letter was sent to us in the respond of the vendor we used only once last year. So whatever the letter was stating made NO sense at all. I’ve been trying to reach them numerous times and not one call was picked up. I would’ve never relied on such insurance company by any means. Be aware!",
    "star_3": 1
  },
  "Electric Insurance": {
    "name_of_reviewer": "kaitlyn316",
    "review_1": "Electric insurance has been awesome! I’ve only had to do a claim one time, but it was super smooth and they guided me through the process step by step. The biggest thing has been changing insurance with new vehicles and that has been very smooth as well, very automated and used email to send and receive documents. Can’t say enough about this experience!",
    "star_1": 5,
    "review_2": "Superb service, was there immediately to help me with my auto collision. I stick with Electric and they stick by me.",
    "star_2": 5,
    "review_3": "Very reliable, quick and responsive to your needs. Coverage is very good, multi policy discounts available. Great customer service.",
    "star_3": 5
  },
  "Vermont Mutual": {
    "name_of_reviewer": "Twins2826",
    "review_1": "Excellent company to do business with! Great service and communication. Timely resolution to claims",
    "star_1": 5,
    "review_2": "I’ve had insurance through Vermont Mutual for 12 years, and have always liked them. They’re easy to do business with and have never caused me any problems.",
    "star_2": 5,
    "review_3": "The company has good prices but takes long to process claims. Some of the employees are also rude on the phone.",
    "star_3": 4
  },
  "Mississippi Farm Bureau": {
    "name_of_reviewer": "jamiehall68",
    "review_1": "Farm Bureau covers our autos, our RV and our house. Only one insurance for everything and we know that we can depend on them to quickly respond to any claim or any questions we might have.",
    "star_1": 5,
    "review_2": "Farm Bureau Insurance is top notch! I have the best agent that cares for my family and I. He explains everything and makes up feel comfortable when purchasing insurance. I recommend Mississippi Farm Bureau to everyone that live in Mississippi. You won’t be disappointed!",
    "star_2": 5,
    "review_3": "My family has used this company for decades. They are very professional and always quick to respond on claims.",
    "star_3": 4
  },
  "Farm Bureau Ins of MI": {
    "name_of_reviewer": "ChrisOverbeck1",
    "review_1": "Farm Bureau has been really good to us. We had damage to our house caused by straight line winds about 2 years ago and they came out quickly to assess and was willing to pay to fix all damages with no questions. I have all my coverage with them as well as life insurance. I have had claims in all areas and they stand up to their word. Thanks for all that you do Farm Bureau.",
    "star_1": 4,
    "review_2": "Recently received a letter from new agent introducing himself and reaching out to me, encouraging me to come in to meet him. That was very professional in my opinion. He allowed me the opportunity to get acquainted with him and on top of that he let me know that he was my new agent. He didn’t leave me in the dark.",
    "star_2": 3,
    "review_3": "Very good service all of it was good even better then I expected to see or hear I loved it so much !",
    "star_3": 5
  },
  "Farm Bureau of ID Group": {
    "name_of_reviewer": "ChrisOverbeck1",
    "review_1": "Farm Bureau has been really good to us. We had damage to our house caused by straight line winds about 2 years ago and they came out quickly to assess and was willing to pay to fix all damages with no questions. I have all my coverage with them as well as life insurance. I have had claims in all areas and they stand up to their word. Thanks for all that you do Farm Bureau.",
    "star_1": 4,
    "review_2": "Recently received a letter from new agent introducing himself and reaching out to me, encouraging me to come in to meet him. That was very professional in my opinion. He allowed me the opportunity to get acquainted with him and on top of that he let me know that he was my new agent. He didn’t leave me in the dark.",
    "star_2": 3,
    "review_3": "Very good service all of it was good even better then I expected to see or hear I loved it so much !",
    "star_3": 5
  },
  "Oklahoma Farm Bureau": {
    "name_of_reviewer": "Shad6pak",
    "review_1": "Farm Bureau will find any way possible to get out of paying insurance after an accident. I was with them for several years and changed when they wouldn’t cover the cost of a car accident I was in. This was little more than a year ago. They wouldn’t come out and take pictures of the wreck until several days later, then stated that they couldn’t be sure the car was damaged because of an accident. I suggest anyone with them to change insurance before they get into an accident. I’m sure they’re are different locations that are good, but if you check out other reviews there are more bad reviews of this company than good ones. I changed insurance companies and save over a hundred dollars every 6 months doing so.",
    "star_1": 2,
    "review_2": "We love Farm bureau. It’s been the lowest price with the best coverage that we’ve found. I’ve compared several other companies and this one comes out on top.",
    "star_2": 5,
    "review_3": "Farm Bureau often has great rates compared to other companies. The staff is helpful and very responsive to e-mails and calls.",
    "star_3": 5
  },
  "Safeco": {
    "name_of_reviewer": "Jmead976",
    "review_1": "Good company; prompt, responsive, professional, and helpful. Been a client for nearly five years and aren’t looking to change.",
    "star_1": 5,
    "review_2": "Prices seem reasonable. The agent that I worked with was helpful. When my car was hit they were communicative and helpful.",
    "star_2": 4,
    "review_3": "I was able to shop around and find a lower quote through Safeco so I switched to them from Progressive. So far all has been great! I’m earning safe driver discounts right now and I’ve already saved $90!",
    "star_3": 5
  },
  "Penn National": {
    "name_of_reviewer": "Cat1234",
    "review_1": "Great company with good agents. Rates are competitive. Service on my claim was outstanding -- fast response, professionally handled.",
    "star_1": 5,
    "review_2": "amazing insurance very good good coverage for a very great price i am overall amazed with the costumer service",
    "star_2": 5,
    "review_3": "I have a policy with Penn National and have been in good standing with them for a few years. My car got water damage from rain and I received a call that my car is totaled and that damage is covered. I call to ask when I can cancel that car since it was totaled and when I will receive check, I then received a call from adjuster that my car is not covered due to lack of maintenance which is a lie. I don’t like this company because they will lie and do whatever they want in the end. Go with a company that is more reputable and larger. I have learned and will be ending coverage.Yelps reviews truly shows the reputation of this get over company.",
    "star_3": 1
  },
  "Safety Insurance": {
    "name_of_reviewer": "Kathleen666",
    "review_1": "Great company. Good discounts for teen drivers, huge discount for advanced driver training (crash prevention). We’ve been pleased with claim performance and with 4 drivers in our household, they have worked with us on how to get our policy costs down.",
    "star_1": 4,
    "review_2": "My experience with this company has been mostly positive but you would think that being with them so long I would get extra perks sometimes - I do like my local business agent but I did have a situation that I felt they could have fought harder for me",
    "star_2": 3,
    "review_3": "I’ve had Safety Insurance for well over 25years, for my car. I have never had a problem with them. I’ve gotten quotes from other company’s but can ’t find one that will bring my insurance lower than $565. a year. So I stay with them.",
    "star_3": 5
  },
  "Indiana Farmers Mutual": {
    "name_of_reviewer": "Kholl",
    "review_1": "Great customer service. They are easy to reach either through the website or my local agent. They offer competitive rates. They’ve paid out claims without guff - one our fault, two the other driver’s. They assist with getting rental cars and ensuring that you know what you’re entitled to.",
    "star_1": 5,
    "review_2": "Indiana Farmers Insurance has been wonderful. Last year, we switched insurance providers to them and they made it so simple and stress free. The communication from them is top notch. I prefer to be in the loop and they make sure I had all info I needed for the next step in the process.",
    "star_2": 5,
    "review_3": "I haven’t any issues or problems with this company. Thier rates are comparable with most other insurances",
    "star_3": 5
  },
  "Western National": {
    "name_of_reviewer": "Smoky",
    "review_1": "Great policy and great people. Always friendly and make insurance easy. The Penalty Free Promise is an amazing feature!",
    "star_1": 5,
    "review_2": "My agent has been absolutely amazing working to get me the best deals and keep me informed about how the policy works and the details.",
    "star_2": 5,
    "review_3": "I was hit by an inattentive driver & my car was totaled. Western National Mutual Insurance company didn’t raise my rates.",
    "star_3": 5
  },
  "California Capital": {
    "name_of_reviewer": "Susan Y.",
    "review_1": "Had my truck stolen. CIG gave me a fair payout in a timely manner. It is a frustrating experience having your vehicle stolen. CIG rented a nice truck for our family during the process which really made a difference. When you have something stolen that you worked so hard for you feel so violated and taken advantage of. Having an insurance company that stands behind you helps to alleviate the anxiety. If you are looking for a good insurance company I highly recommend CIG.",
    "star_1": 5,
    "review_2": "How can a company keep raising rates on a car that is depreciating monthly? Been with this company for almost 10 years, no claims, and I pay in full and early. When I don’t feel like I am appreciated for being a reliable customer, I move on. BYE FELICIA!\r\n\r\nUpdate: I found much cheaper insurance through MetroMile, 77% cheaper with same full coverage. Since I drive under 1200 miles a year, CIG gave me the biggest flack with that, saying that average is 5000 miles a year. Sorry CIG but why should I pay for mileage I am not using? Give me a break.",
    "star_2": 1,
    "review_3": "We have been insured for our two vehicles since 2013. In the last year our insurance on our vehicles has increased from $452 every 6 months to $857 for Vehicle 1 (2015 Mini Cooper), and $434 to $498 every six months for Vehicle 2( 2016 Subaru Crosstrek). We drive each vehicle less than 3000 miles per year and are accident and claim free. We finally decided to research other companies after our agent would not return our phone calls. We are going with highly rated AARP Hartford at a savings for exactly the same coverage of almost $1,000.00 per year. We should have switched a long time ago. Now if we can get in touch with our agent, we are done as of June 19.",
    "star_3": 1
  },
  "SECURA": {
    "name_of_reviewer": "ha110ween",
    "review_1": "Happy with Secura! Really good service, comprehensive policy, fair pricing. I will not be shopping for a new provider anytime soon.",
    "star_1": 5,
    "review_2": "Easy to work with and has great rates. We have two cars and a house bundled and everything is taken care of. Filing a claim is easy and convenient to do.",
    "star_2": 5,
    "review_3": "I have home, auto, business, and other policies through Secura. In the past year, unfortunately, I have had to make several claims. Every one of them was handled professionally, fairly, and quickly.",
    "star_3": 5
  },
  "Celina Insurance": {
    "name_of_reviewer": "DBL",
    "review_1": "Have a log home means high rates except with Celina. Their rate was less than half of anyone else we could find in Knoxville, TN and that was with better coverage. We requote every year and Celina has been the best year after year.",
    "star_1": 5,
    "review_2": "I had very prompt services with 3 accident claims and appreciated the friendly representatives. The road side assistance was amazing and fast for a quick tire change for my daughter. I was always set up quickly with my rental car and no issues there.",
    "star_2": 5,
    "review_3": "The greatest asset Celina Insurance has besides a fair price and a good product is when you call-someone actually answers and you don’t have to listen for five minutes to find out which number to push. I was pulled over to check my registration and insurance and of course my Auto ID Card had expired. I called Celina and someone texted a copy of my ID Card in under a minute-I felt like I was back in the 50’s. \"Service\" what a great idea!",
    "star_3": 5
  },
  "Farm Bureau Mutual": {
    "name_of_reviewer": "Plasticpopcorn",
    "review_1": "I absolutely love this insurance company. They are amazing, always have great customer service and I love that they work with me for my price.",
    "star_1": 5,
    "review_2": "The company is strong overall and has good leadership. They are always friendly and get the job done in a quick and timely manner. Would highly recommend them",
    "star_2": 5,
    "review_3": "Fantastic rates. Fantastic service. Very responsive and helpful. Explained everything in depth and was not pushy.",
    "star_3": 5
  },
  "North Carolina Farm Bureau": {
    "name_of_reviewer": "Plasticpopcorn",
    "review_1": "I absolutely love this insurance company. They are amazing, always have great customer service and I love that they work with me for my price.",
    "star_1": 5,
    "review_2": "The company is strong overall and has good leadership. They are always friendly and get the job done in a quick and timely manner. Would highly recommend them",
    "star_2": 5,
    "review_3": "Fantastic rates. Fantastic service. Very responsive and helpful. Explained everything in depth and was not pushy.",
    "star_3": 5
  },
  "Tennessee Farm Bureau": {
    "name_of_reviewer": "Mrscasey39",
    "review_1": "I actually have my homeowner’s policy with this company as well as auto. I have had a few claims over the years for both policies. Farm Bureau has always been fair, quick to respond and hasn’t penalized me for my claims.",
    "star_1": 5,
    "review_2": "great price always works with me when I have any issues nice, good, & friendly people always willing to help",
    "star_2": 5,
    "review_3": "It was wonderful. Never had any problems what so ever. Any time i needed something they took care of it.",
    "star_3": 4
  },
  "National General": {
    "name_of_reviewer": "5charles47",
    "review_1": "I am pleased with National General. They have paid claims promptly and quickly. Very supportive company.",
    "star_1": 4,
    "review_2": "rates are pricey but the coverage is good they offer alot for the price and care about the customers needs",
    "star_2": 5,
    "review_3": "Very expensive and poor coverage. Customer service is not very knowledgeable plan to change next month to Nationwide.",
    "star_3": 2
  },
  "Safeway": {
    "name_of_reviewer": "beatgodz",
    "review_1": "I am so grateful for this company. I highly recommend it. I truly love the way they treat me and how effective they are.",
    "star_1": 5,
    "review_2": "Horrible experience. Moral of story they don’t cover everything that they say they cover . They actually don’t cover anything! I had to purchase my car out of towing cash and now I have to get it fix cash because the insurance I pay for on time doesn’t cover any expensive. WOW such a rip off !",
    "star_2": 1,
    "review_3": "very cheap always ready to help always under 100. fast soons as you have the cash your insured and safe to drive",
    "star_3": 4
  },
  "National Farmers Union P&C": {
    "name_of_reviewer": null,
    "review_1": "I am very happy that I have renters insurance with this company. Good people with there. Very happy with the price.",
    "star_1": 5,
    "review_2": "Great company! They have provided insurance for my pickup and horse trailer and also for my parents farm for as long as I can remember. They always have great customer service and I think their rates are very reasonable. In over ten years of serviceI have not one complaint about them.",
    "star_2": 5,
    "review_3": "It is an amazing insurance company. I had a few car crashes and they covered it to my liking. Very good! I recommend it to all.",
    "star_3": 3
  },
  "Tower Ins Co of New York": {
    "name_of_reviewer": "Anthony Ho",
    "review_1": "I cannot imagine a worse insurance company. We had a homeownerʻs insurance policy with them for years. Their website is horrible. At first, it was not even possible to navigate it to pay my bill. Every time I would pay the bill I would receive a notice a few days later saying my homeownerʻs insurance was cancelled. A few days after that, I would receive a notice saying it was reinstated. A few days ago, I sold my home and needed to cancel my policy. When I looked at their \"contact\" page, the only method to contact them was an email page. I sent an email asking for instructions, but still have not received a reply.",
    "star_1": 1,
    "review_2": "I have been fighting them through my attorney for close to 4 years on my work injury! They dragged me through HELL and back, and now that I have won my case in court, they are still not paying me!! Their reason is \"We did not have expect to lose and didn’t put away enough money for this case\", Now they are getting an additional $5,000.00 penalty fees added and it may go as high as $10,000.00, BECAUSE THEY ARE SO INCOMPETENT! If you have to deal with them, cover yourself with patience and hope your not looking for payments any time soon!!!\r\nShould be shut down!!!!!!!",
    "star_2": 1,
    "review_3": "This company has worst customer service. Requests submitted on the web was not processed and not returned. Called the customer service and waited like forever before talking to someone. Also, got different answers from different representatives regarding cancelling the policy(30 days via web vs. written request required vs. need to be done by new insurance company). Totally unprofessional!",
    "star_3": 2
  },
  "Cameron Insurance": {
    "name_of_reviewer": "Emily Rackers",
    "review_1": "I don’t know how much they are paying people to write the clearly bogus positive reviews on here but let me tell you: This is the absolute worst, fly-by-night, joke of an insurance company I have ever had the displeasure of dealing with. If you should ever find yourself having to deal with them, may God have mercy on your soul.",
    "star_1": 1,
    "review_2": "I am sure they are very efficient making sure 100 % of the insurance premium is paid by their customers. However, when it comes to paying a clear 100 % insured loss, they think paying only 64 % of the loss is OK, leaving the insured (the person who paid 100% of the premium) exposed to further claims.",
    "star_2": 1,
    "review_3": "I am the office manager at a collision center and unfortunately have had to work with Cameron on many occasions. Lea Hamill, apparently one of their only adjusters, is rude, condescending, and downright hateful. They send third party adjusters to write half estimates and then patronize the shops for having their customers best interest in mind. If you have Cameron, you better hope you never have an accident, because they will not help you and will treat you as an like an idiot.",
    "star_3": 1
  },
  "Safe Auto": {
    "name_of_reviewer": "Zuka",
    "review_1": "I felt they didn’t hold up their end of the agreement. I had some problems with them. When I went to call them I was put on hold for a very very long time and once a representative answers I was given no respect for being a customer. They seemed to be very annoyed because of my calling and the issue was not resolved. I ended up cancelling with them shortly after the phone conversation.",
    "star_1": 1,
    "review_2": "I was amazed at how much lower the payments are than other companies I shopped.the phone agent was excellent and very helpful",
    "star_2": 5,
    "review_3": "I am very setisfied with the company. I had auto insurance 2 years ago but i am planning to visit the company again",
    "star_3": 4
  },
  "Ameriprise": {
    "name_of_reviewer": "F of Pompano Beach, FL",
    "review_1": "I get my insurance through my Costco membership & I OFTEN refer others as Ameriprise (you don’t have to be Costco member but it costs slightly less & has more benefits when you are). Has been very competitive & customer service has always been very helpful & friendly. My last car caught on fire while on a trip to neighboring state & the adjuster made the process easy to deal with (I was all shook up & had no idea what to do next. He helped me through it all & never made me feel like I was a bother)...& took care of everything in a very timely manner.",
    "star_1": 5,
    "review_2": "I switched to this carrier, and have been pleasantly surprised at the savings and the quality of the service. They were faster to help me on the phone than my previous (nationally known) carrier - I had that previous plan through a broker. This I got through Costco. The coverage is identical but I am saving money each month.",
    "star_2": 5,
    "review_3": "I had this insurance company for 20+ years. They gained my trust when I first got them in my 20’s. Because within a couple of months of signing up with them I had my first car accident. I had heard horror stories about how companies would drop you or raise your premiums way up. They did not do either of those things which was amazing to me. I don’t know what I would/could of done if they had specially since I was young and broke. So until this day I truly recommend them, they are trustworthy and have great customer service. Also their rates are competitive with other insurance companies if you have a new car.",
    "star_3": 5
  },
  "Nationwide": {
    "name_of_reviewer": "george875",
    "review_1": "I had to file a claim because my son was in an auto accident as a passenger in another car. Although my auto was not involved, the claim for his injury went to my insurance. It was simple, they explained everything, I was done in just a few minutes. After 72 hours, they called to check on my child and make sure to update me on everything.",
    "star_1": 5,
    "review_2": "This review is for both Auto and Homeowners policies. I have been a customer of auto for 20+ years, and homeowner for 4 years. The agents are always friendly and helpful. They go out of their way to assist you and find you the best rate for you and your family. Liked getting the rebate due to corona",
    "star_2": 5,
    "review_3": "Nationwide provides fantastic insurance and I have had no problems with them.",
    "star_3": 5
  },
  "West Bend Mutual": {
    "name_of_reviewer": "Ashleydid",
    "review_1": "I have been fully satisfied with the care and policy. Everyone who I have spoken with has been eager to help and simplify all the processes",
    "star_1": 5,
    "review_2": "This company has always been there for assistance. \r\nWindshield chips have been my biggest issue and \r\nthe problem was repaired without using the deductible",
    "star_2": 5,
    "review_3": "The insurance policy has been good. We have not had many claims but the couple we have had were handled quickly. They have worked with us to get our issues fixed. I do feel they are slightly expensive but you get 10% back each year if you are claim fee.",
    "star_3": 4
  },
  "Westfield": {
    "name_of_reviewer": "JillS",
    "review_1": "I have been pleasantly surprised at how easy it is to work with this company. In addition, their premiums are not super high. They have been a solid supplier of my auto insurance for over 5 years, and I will continue to use them. They have paperless statements and offer a discount if you enroll in autopay. I appreciate both of those benefits",
    "star_1": 4,
    "review_2": "After months dealing with the other persons insurance, I decided to file a claim with my insurance, Westfield. Literally, days later I had check in hand and repair scheduled. Highly recommend!",
    "star_2": 5,
    "review_3": "Wonderful company, fabulous claims and customer service! I couldn’t be happier with the speed of handling my claim, the responsiveness of my local agency, and the stability of Westfield Insurance. Highly Recommend!",
    "star_3": 5
  },
  "Bear River": {
    "name_of_reviewer": "Katelyn Stucki",
    "review_1": "I have had Bear River for many years and they have taken care of all my claims very quickly, I am greatly satisfied. They have the lowest rates and best customer service. Highly recommended",
    "star_1": 5,
    "review_2": "We were on a mission for our church in Virginia and our Nephew and his family were living in our house while we were away. When our home caught on fire while we were away, BRM had our home repaired, covered our belongings and housed our Nephew’s family for several months while our home was being rebuilt.",
    "star_2": 5,
    "review_3": "I’ve had Bear River Mutual Insurance for almost a year now. They have THE BEST RATES!!! \r\n\r\nThey are so easy to work with! We originally switched because someone hit my car and they had bead River. Bear River took super good care of me and hooked me up with a rental for a few days. \r\n\r\nSince I’ve switched, I had a kitchen flood. It was a huge mess and obviously very inconvenient, especially happening right at the beginning of all the Covid-19 stuff! They hooked us up with a temporary sink and extra folding table, since we had to rip out our lower cabinets. Mike Shaw was our adjuster and very easy to work with! He responded to emails promptly and did a great job communicating everything to us and talking us through all of our options. \r\n\r\nThis week I received a renewal contract for this next year. Many of their reviews suggest they drop their clients after filing claims, but they did not drop us and we are so grateful to have more time with them as our insurance company! I refer everyone I know to them.",
    "star_3": 5
  },
  "Grange": {
    "name_of_reviewer": "witalis007",
    "review_1": "I have had two unfortunate flood experiences at my house. One was due to a rain storm and the other was caused by a faulty sump pump. Grange was a lifesaver. They called in a company to come to my house and move furniture, set up fans, rip up carpet, and spray to kill any possible mold. This was all done within 6 hours of my phone call. Within 2 days they sent an adjuster to the house and he cut a very reasonable check while sitting in my driveway. I couldn’t have been taken care of any better. I got a follow up call to make sure that I felt everything was done satisfactorily. I have heard horror stories where people are afraid to make a claim because their insurance company will drop them. I’m not sure why you would have insurance if you are afraid to use it.",
    "star_1": 5,
    "review_2": "This is a good company. I like it a lot. We have used it for a long time and it has good insentives Andy we are happy with it.",
    "star_2": 5,
    "review_3": "So far loving it, but haven’t needed to file a claim yet, so can’t speak to that. \r\nThe agent was good to deal with. They saved me 50% over what Farmers was charging me and I ended up with superior coverage. \r\nIt was finally worth it for me to bundle my auto and home.",
    "star_3": 4
  },
  "Rockford Mutual": {
    "name_of_reviewer": "Saddis322",
    "review_1": "I have had wonderful auto insurance with Rockford Mutual Insurance Company through [REDACTED NAME] [REDACTED NAME]. I have had nothing but wonderful experiences with all employees.",
    "star_1": 5,
    "review_2": "Excellent customer service. Fantastic competitive rates! No complaints! Trustworthy company doing good business locally",
    "star_2": 5,
    "review_3": "We love Rockford Mutual. They are always available when we need them. They were very helpful during an accident.",
    "star_3": 5
  },
  "PEMCO": {
    "name_of_reviewer": "Ckreis",
    "review_1": "I have have a policy through PEMCO for the last 7 years and always have great customer service. I recommend them for Auto and Homeowners Insurance.",
    "star_1": 5,
    "review_2": "Great company to work with. I was in a small accident last month and it was so easy to deal with. I would highly recommend them.",
    "star_2": 5,
    "review_3": "I had a claim of a hit and run on my vehicle. I did follow the guy home and he ended up being a neighbor that was driving under the influence and with a suspended license. I called PEMCO and they told me to go right into any company I chose and get it fixed. I had to pay $100 for the claim. It was fixed and paid for in one week. I called the police and he was arrested. PEMCO followed up on my claim and 3 months later they refunded my $100. They have great customer service and low rates. My rates did not go up.",
    "star_3": 1
  },
  "Grinnell Mutual": {
    "name_of_reviewer": "victim",
    "review_1": "I have not had any problems with this company. I have not filed any claims. The agent that I got the policy with was very helpful and knowledgeable.",
    "star_1": 4,
    "review_2": "I have not had a claim. But their price is good and no unnecessary costs or work to be done. They were far less than progressive once I didn’t have multiple policies.",
    "star_2": 5,
    "review_3": "One of their clients hit us in auto accident! he claimed 100% @ fault. 7 years ago! REFUSE TO accept responsibility!!!",
    "star_3": 1
  },
  "Partners Mutual": {
    "name_of_reviewer": "DakotaRose409",
    "review_1": "I have nothing good things to say about Partners! When my husband hit a deer they made everything so easy and I never had to worry about anything! This was very important to me because I had just had our newborn son and dealing with insurance, car rental, and the headache of it all was the absolute last thing I needed. They were wonderful!!!",
    "star_1": 5,
    "review_2": "I have nothing good things to say about Partners! When my husband hit a deer they made everything so easy and I never had to worry about anything! This was very important to me because I had just had our newborn son and dealing with insurance, car rental, and the headache of it all was the absolute last thing I needed. They were wonderful!!",
    "star_2": 5,
    "review_3": "Excellent insurance agents to help with your needs and they are very friendly! They have reasonable insurance rates!",
    "star_3": 5
  },
  "New Jersey Manufacturers": {
    "name_of_reviewer": "KarlaSan",
    "review_1": "I have used NJ Manufactuers for several years now for my car insurance. The people who work there have shown themselves to be fast and effective when I have talked to them on the telephone. The pricing of the insurance is higher then most of their competitors. However, if you have an accident that’s not your fault, you won’t get punished for it,as you would be some other insurance companies. In conclusion,if you can get insured by this company, do so.",
    "star_1": 5,
    "review_2": "NJM is fantastic. I have had to use their services once or twice. The most important factor to me was hasslefree claims, and also the fact that they provide dividends annually is great!",
    "star_2": 5,
    "review_3": "As I was told, you never pay DV claims. Your methods of resolution are questionable & ur lack of interest to resolve claims are very evident. Wonder how many victims weren’t compensated for accidents at your client’s faults. I hope someday @USSupremeCourt investigates your methods. You guys are worst than a virus, you’re a disgrace for people victims where their life cross with this insurance.",
    "star_3": 1
  },
  "Auto-Owners": {
    "name_of_reviewer": "Dale of Tucson, AZ",
    "review_1": "I have used them for home, auto, boat, camper for at least 20 years. Had a few claims, that were handled fairly, no big premium increases as a result. I know I am not paying for over the top TV, radio, airplane banner, magazine advertising. If you don’t like your agent, find another one. The agent does not pay the claims, but should at least be responsive and polite.",
    "star_1": 5,
    "review_2": "I felt compelled to write a review as I noticed their fairly low rating on here. This is obviously due to people not understanding their coverage. We were victims of a nasty hail storm where we lost 18 windows, 3 sides of siding, and the entire roof. Auto Owners was extremely easy to work with and did not fight our contractor’s invoice whatsoever. At the same time our neighbors (with similar home values) were offered HALF of what Auto Owners offered. Half is a big number when most of the exterior of the house needed to be replaced. Pay a few extra bucks and let Auto Owners insure everything that is important to you!",
    "star_2": 5,
    "review_3": "I have only had to claim the use of my roadside coverage, thank God. That service has been wonderful all the way around from my call to the end result with professional and prompt service. I have recommended this company to others.",
    "star_3": 5
  },
  "Commerce Insurance": {
    "name_of_reviewer": "djfreddiettm",
    "review_1": "I love commerce, I had a total loss a year ago and they helped me through everything and made the change to my new vehicle very easy",
    "star_1": 5,
    "review_2": "They are awful!! They will never give you your money worth!! They will keep you on hold for long period of times",
    "star_2": 1,
    "review_3": "I enjoy working with Commerce. They have always been good to me and help me with all of my claims that I have",
    "star_3": 1
  },
  "Oregon Mutual": {
    "name_of_reviewer": "s87",
    "review_1": "I love Oregon Mutual! prices are competitive. Never have had an issue with them! We get a multiple discount for auto and home insurance!",
    "star_1": 4,
    "review_2": "Made us paint our chicken cup and parts of the garage...Very strange! Our agent had never heard of this. Also, Did not want to insure a woodstove! Ridiculous!",
    "star_2": 3,
    "review_3": "Awesome company to work with. Got auto insurance with them roughly 3 years ago and they offered great rates. My agent recommended accident forgiveness and I’m glad I added it to my policy. I had an unfortunate accident where the cops rated 50/50 fault which I’m told means \"at-fault\" from an insurance standpoint. Not only was Oregon Mutual AMAZING to deal with in the claim process, but my rates did not increase as a result of the accident. I cannot recommend them highly enough.",
    "star_3": 5
  },
  "Permanent General": {
    "name_of_reviewer": "Lovinglife92",
    "review_1": "I needed insurance asap and this was the only one I could could at 1am, It was state min but was a resonable price I didnt have any claims, but have a very good experince with customer service they were very helpful .",
    "star_1": 4,
    "review_2": "My membership with the general has been great. They are always sending my updated information to the right email and i have not been billed incorrectly at all. They always have great customer service reps as well. All my questions have been answered. I’m happy with them.",
    "star_2": 5,
    "review_3": "I enjoy having my car insurance through The General. When I had to file a claim the process was simple and the customer representative was nice and helpful.",
    "star_3": 5
  },
  "Countryway Insurance": {
    "name_of_reviewer": "Robbieboy82",
    "review_1": "I really like the company. I have had no issues. I do wish the website had a ittle more to it sometimes I like to pay a little earlier and its not available to do its very basic.",
    "star_1": 5,
    "review_2": "I live in a rural area loaded with farms. Countries specializes in these areas. My local insurance agent suggested them when I moved back to the area. I have never had a claim. The prices are better than I had at All state and better coverage.",
    "star_2": 5,
    "review_3": "I really like the company. I have had no issues. I do wish the website had a ittle more to it sometimes I like to pay a little earlier and its not available to do its very basic.",
    "star_3": 5
  },
  "Patriot Insurance": {
    "name_of_reviewer": "Jawsoflife",
    "review_1": "I really like this company, they have good coverage and I feel protected with them as my car insurance.",
    "star_1": 5,
    "review_2": "They have been great, low pricing for full coverage and have helped me out the only time i needed it with towing expenses covered",
    "star_2": 5,
    "review_3": "No issues but so far I have not had a claim. It has been easy to deal with them on changes of covered people and banking info",
    "star_3": 5
  },
  "Erie": {
    "name_of_reviewer": "OHSubaruDude",
    "review_1": "I received great customer service recently when I inquired about my upcoming auto renewal. I did not receive a bill so I my local office. I was treated with respect and the agent was prompt in resolving the issue. A new policy was issued and received within the week.",
    "star_1": 5,
    "review_2": "I had auto insurance with Erie for over a year and out of nowhere they called to tell me that they were dropping my policy because of a paid cell phone ticket from 2 years before! No notice or warning, nothing! They just dropped my insurance and left me standing! Be careful when switching to them!",
    "star_2": 2,
    "review_3": "Erie Insurance is a great, cost effective insurance company. Used them for Home, Auto and Umbrella and the claims process was the best I’ve experienced. Car got hit by a rock on the interstate and Erie took care of everything. The repair, rental, and everything in between. Great company that I highly recommend.",
    "star_3": 5
  },
  "Liberty Mutual": {
    "name_of_reviewer": "kmc50",
    "review_1": "I signed up with Liberty online less than a year ago and I have been pleasantly surprised by my rates and discounts that I have received. The rate I pay was really a nice surprise when I signed up being so low and then I signed up for the safe driver program and I recently got another discount for completing that program. I am really happy with my rates and recommend any one who is looking for a new insurance company to check out Liberty Mutual.\r\n< Read less",
    "star_1": 5,
    "review_2": "I highly recommend liberty mutual, rate is better and competitive than other insurers, rate payment forgiveness. Friendly customer service, filing a claim is easy and painless.",
    "star_2": 5,
    "review_3": "Liberty Mutual is very reliable and not too pricey. I also really like that they have a mobile app, which makes it very intuitive and easy to use.",
    "star_3": 5
  },
  "North Star Mutual": {
    "name_of_reviewer": "Wiley205",
    "review_1": "I think that the policy as a whole is very helpful. The important parts helped me overall with my auto insurance and i’m glad that i joined this company",
    "star_1": 5,
    "review_2": "Great insurance especially when you have a young driver in the house. Always great customer service and my agent gets back to me right after I email her.",
    "star_2": 5,
    "review_3": "Have only had good experiences. Whenever there was a problem, they would respond in a timely manner.",
    "star_3": 4
  },
  "State Farm": {
    "name_of_reviewer": "Thefuzzman1",
    "review_1": "I was driving my car and someone waved me down. My hood was smoking and immediately went on fire. He got me out of the car and the fire department came. The insurance company told me it was a total loss and gave me everything I had paid for the car. I was so grateful.",
    "star_1": 5,
    "review_2": "They always have hidden fees and always hide stuff i feel when i go in there are always things they never told me about",
    "star_2": 3,
    "review_3": "Great and easy to work with. Attentive to details. Calls on a timely matter. Caring. Lovely. Best company.",
    "star_3": 5
  },
  "Esurance": {
    "name_of_reviewer": "swdm2015",
    "review_1": "I was surprised how easy it was to find exactly what I wanted and it costed me almost half of what I was paying with my old insurance company and I have been with them of over 5 years. They make have a good insurance without breaking the bank. I glad I decide to go searching for a new car insurance plan.",
    "star_1": 5,
    "review_2": "Esurance has been great! They always work with us on our rates. We don’t have any complaints about their service.",
    "star_2": 5,
    "review_3": "This company makes it extremely easy for someone with anxiety to purchase a policy without having to make a phone call. Their website is very easy to navigate and understand. They also rebated some of my premium since the COVID 19 pandemic. Very pleased with them.",
    "star_3": 5
  },
  "Ohio Mutual": {
    "name_of_reviewer": "Cheviot_girl",
    "review_1": "I was with another insurance company that decided to keep raising my premium every renewal period. Thus started looking for another insurance company. I had used this agency in the past and thought that would be a great starting place. For finding my new policy. This is when they suggested Ohio Mutual Ins Group. I questioned the company’s reputation. I was reassured by them telling me it was the same company I’d used before when I was with them. I got the quote and was taken aback. When they gave me the price of the quote. It was almost half the price of my then insurance company. Then I decided to ask about lowering my deductibles. I ended up lowering it. From $500 that my old policy had, that I’d be replacing to $100 on both collision and comprehensive. My old policy had the higher deductibles and run me $134 a month. My new policy with the new company was going to be $70 a month. I couldn’t pass it up. Cause I’d already had my trust in this company from having already at one time without complaint. So I bought the policy and paired it also with my renters policy. So with both. My monthly premium is a total of $79. I have no complaints so far and am happy with the web site this company has too! I recommend this company to anyone looking to save on their car insurance.",
    "star_1": 4,
    "review_2": "This was the cheapest policy that I found when I was shopping for insurance. We haven’t filed any claims, but I appreciate that the sent a letter recently that basically expanded what their insurance offers us at no extra cost.",
    "star_2": 5,
    "review_3": "We have been loyal customers for over 17 years. Our local agents were wonderful and very helpful. Our daughter was in a car accident, she was hit by a young man who ran a stop sign, no fault of her own. Ohio mutual was very unprofessional with us! Phone calls and emails went days unanswered. When we finally got an adjuster to call us back she was rude and offered us three thousand less than what our car was worth. Very unprofessional, we felt like we was a bother, you could tell she didn’t enjoy her job and she took it out on us. We ended up going through the other party’s insurance which was State Farm. They offered us a very fair amount of money to replace the totalled car. We have switched insurance over this. Do your homework before trusting Ohio mutual insurance!!!",
    "star_3": 1
  },
  "Auto Club (AAA)": {
    "name_of_reviewer": "callmejenleigh",
    "review_1": "I would like to commend AAA for issuing a refund during the COVID-19 crisis. However, it would have been nice to see a longer period of refund coverage like some other anise have done.",
    "star_1": 4,
    "review_2": "This company is always there for me when I need it. Always quick to respond when we need it. Great company overall!",
    "star_2": 5,
    "review_3": "I have the bundle with AAA. Homeowners, auto, and membership. The only thing so far I don’t like is how the home insurance keeps going up. Auto has been fair.",
    "star_3": 5
  },
  "Wolverine Mutual": {
    "name_of_reviewer": "sport",
    "review_1": "I’ve been very Happy with my Insurance company. They have always been fair with pricing and after checking other companies I’m already getting the best price I can from them .",
    "star_1": 5,
    "review_2": "Lousy raise your rates beacuse they can. Make it hard to keep rates lower will not renew my policy",
    "star_2": 1,
    "review_3": "good price good agent no problems always willing to help when need help, always looking out for the best price",
    "star_3": 5
  },
  "USAA": {
    "name_of_reviewer": "louisk",
    "review_1": "it is okay but they continue to raise prices and never give rewards to long time customers. Would be nice to at least keep same rate.",
    "star_1": 4,
    "review_2": "It’s good service it gift the customer the service he need and look for good work in market so i feel good with them",
    "star_2": 4,
    "review_3": "really good comprehensive coverage at a reasonable price, lots of good options and always very courteous",
    "star_3": 5
  },
  "Direct Auto": {
    "name_of_reviewer": "staffco09",
    "review_1": "It was a pretty unexpected experience if I had to give my honest opinion. They were very kind and understanding to my lack of understanding concerning automotive insurance. That being said I’d highly recommend them to anyone.",
    "star_1": 4,
    "review_2": "I absolutely love this company. They work with you to make sure you get the coverage you need and want. Prices are low",
    "star_2": 5,
    "review_3": "Direct is a great ins company, their rates are very cheap and much cheaper then other company, If your struggling to find inse at a great price check out direct ins,",
    "star_3": 5
  },
  "Chubb": {
    "name_of_reviewer": "Jlawrence",
    "review_1": "It was really nice, I did not have any problems during my visit. Not only that, the person that was guiding me, was really calm and supportive, though it was a tedious procces.",
    "star_1": 5,
    "review_2": "If I had the money I would sue this company in a bad faith lawsuit. No response from staff, no response from emails, and overall an ethical business practice. My vehicle was deemed a total loss when I was able to have it repaired at a reasonable cost my claim was denied I had to pay $1,600 out of pocket to have my car repaired. Completely shocked that this company has not been sued yet.",
    "star_2": 1,
    "review_3": "They went from my favorite insurance company to worst ever. After a burst pipe and a hail claim all totaling under 75k, they declined to renew me with less than 30 days notice. I am a high net worth individual as well. Instead of continued recommendations to friends and associates, I will now be spreading the word to avoid them like the plague.",
    "star_3": 1
  },
  "State Auto": {
    "name_of_reviewer": "Johnthejp",
    "review_1": "Its a good company that offers different kind of packages of insurances. The customer service is excellent",
    "star_1": 4,
    "review_2": "Gave estimate through pictures on an app. Appraisers set estimate at half the price of the body shop.",
    "star_2": 1,
    "review_3": "Terrible, fast collect very slow when paying. Don’t mess with this company or they will mess you up. Reporting to BBB soon.",
    "star_3": 1
  },
  "Acuity": {
    "name_of_reviewer": null,
    "review_1": "Joey Marz\nI had Acuity for the last couple years with no problem. \nHowever, today I received notice that upon my policy renewal, my premium was *increasing* by over $400! During a pandemic when nobody is working! When there are way less people on the road! Immediately lost my business.",
    "star_1": 2,
    "review_2": "Положительные: Качество, Отношение к клиентам, Профессионализм, Цена/качество\nI would recommend Acuity to anyone. There is always a friendly voice on the other end of the line. They are responsive. The price is right. And from all reports it is a great company to work for. That is important because if you treat your employees well everyone is happy and that trickles down to your customers.",
    "star_2": 5,
    "review_3": "Shqipron Qunaj\r\nAcuity is truly incredible to the community! They have contributed to local schools and hospitals in addition to allowing the employees to vote how to distribute $500,000 to local charities. They also open the building to local events and fundraisers.",
    "star_3": 5
  },
  "Frankenmuth": {
    "name_of_reviewer": "Caty Johnson",
    "review_1": "Just wanted to say Thank you for helping me during g this rough year. Brandon Foster is amazing! I am so blessed. Everyone has been so helpful. Just cannot say enough",
    "star_1": 5,
    "review_2": "Excellent insurance office with great people!",
    "star_2": 5,
    "review_3": "Carly Gault was AMAZING! Period. We could not have asked for a better claim rep. She was very patient and explained the process/policy/coverage to us in a way we could understand. She returned calls promptly and was absolutely a breath of fresh air during a very difficult time for us. I would recommended Frankenmuth with the hope that everyone gets to interact with Carly.",
    "star_3": 5
  },
  "Workmen’s Auto": {
    "name_of_reviewer": null,
    "review_1": "Like it a little bit off better with another Brand to expensive . They don’t really communicate with the costumer. I have to go to a second party office where their they answer all my complaints and worries. They are good to call you when you hauled a accident.",
    "star_1": 4,
    "review_2": null,
    "star_2": null,
    "review_3": null,
    "star_3": null
  },
  "EMC": {
    "name_of_reviewer": null,
    "review_1": "Little pay with no room for growth. Good culture and work balance though. Management was okay but there were a lot of changes happening which is why I left",
    "star_1": 4,
    "review_2": "This was the best job I have ever had. The culture, the benefits, and the people are second to none. It is a large employer and I was on the executive floor, so I didn’t have a lot of interaction with those outside the executive level, but everyone I met was wonderful. They helped me learn, and they learned from me. The administration was stellar and the job was challenging. The pay and benefits were the best I’ve ever had. I was so sad to leave due circumstances beyond my control!",
    "star_2": 5,
    "review_3": "I loved working at EMC I was able to grow professionally. Great job environment along with much volunteering options. Great place to work! Management provided \"family like\" environment.",
    "star_3": 4
  },
  "Allied": {
    "name_of_reviewer": null,
    "review_1": "MichaelL65 Car insurance review They offered me a plan that was a realistic minimum as opposed to the legal minimum, which ironically ended up being cheaper. I appreciate that and many of the \"add-ons\" that were available. I am able to pull up my information on my phone whenever needed. My only complaint is the roadside service can be very slow.",
    "star_1": 4,
    "review_2": "Car insurance review Basically, I like this company because of its policies, which allows me to adjust, change, and switch anytime that I want.",
    "star_2": 4,
    "review_3": "coolfriend Car insurance review Everybody was always very helpful and customer service was polite. Allied insurance never ceases to amaze me.",
    "star_3": 5
  },
  "MMG Insurance": {
    "name_of_reviewer": "ThankYou",
    "review_1": "MMG has been incredibly helpful with processing claims. They are able to process claims directly with repair shops so that you can leave your vehicle and the whole process in their hands. We’ve had very good luck with them and decent premiums.",
    "star_1": 4,
    "review_2": "I have had good rates with this company and when I had an accident (at no fault of my own) they were great to work with to get my vehicle repaired.",
    "star_2": 5,
    "review_3": "I am the beneficiary of MMG Insurance. The chain service garage I’ve used for years made a mistake, thinking they were changing differential oil and left my transmission empty. MMG figured the replacement cost plus any costs of associated repair would be about the book value of the car. Less than a week later, they have the title and I have a check, which includes a percentage for the new tires I’d just put on. MMG is great!",
    "star_3": 5
  },
  "Cincinnati Insurance": {
    "name_of_reviewer": "bigron",
    "review_1": "My independent insurance agent recommended Cincinnati Insurance as both cost effective and providing quality coverage. I’ve not had to file a claim but my agent has been so helpful and informative that I feel very confident the company will provide coverage without issue should I need to file a claim. They’ve provide good customer service when I called regarding online access to my account and billing questions.",
    "star_1": 4,
    "review_2": "I’ve been with this company and agency since 1982, and I’ve never had a problem with them. They performed tremendously about a decade ago when we had major storm damage. An agent was at our house the very next morning to assess the damage, and he had flown from Wisconsin to Ohio that very morning to help out the other agents on site in the area. We had a check, IN HAND, within a half-hour! AND a promise that if more was needed to cover the repairs to just let them know and another check would be in our hands. They paid every penny with no questions or delays!",
    "star_2": 5,
    "review_3": "My agent highly recommended your company and when we had a problem you contacted us and [REDACTED NAME] your claims specialist worked with us and had a response very fast. For my first time working with Cincinnati Ins I had an excellent experience.",
    "star_3": 5
  },
  "Concord": {
    "name_of_reviewer": "jnc880",
    "review_1": "Needed 2 windshields replaced. They did then cancelled my policy. Shame on You. You are a terrible company. Paid you thousands over the years and then for 2 windshields you cancel",
    "star_1": 1,
    "review_2": "Worst Insurance company I have ever had a claim with.\r\nLow ball offers.\r\nAdjuster did not understand what a Carbon Fiber Roof was??",
    "star_2": 1,
    "review_3": "For me I have been with the company for a very long time and it was the cheapest company [REDACTED NAME] found for me. I have never had a problem or an accident. I feel though I was paying less when I first Joined and got insurance. I do understand my Jeep is a newer model making the insurance rate higher. Its still the cheapest I can get as I was told I have no credit which reflects on Insurance you buy. Overall its a 4 out of 5 star company. But I feel they should reward costumers thats been with them for a long time and had no accidents.",
    "star_3": 3
  },
  "Norfolk and Dedham": {
    "name_of_reviewer": "winnie laner",
    "review_1": "NEGATIVE 5 STARS. WORST COMPANY on planet Earth. I was involved in an accident with their client( lady hit my car, nothing too major). I’m here thinking to myself, not a big deal, shouldn’t be a pain in the back but no, they’re experts of making everything very PAINFUL and complicated. The staff are RUDE and plain disrespectful. This minor fender bender is still an ongoing thing and they’re doing everything they can to not reimburse me for this damage. If this continues, I will be taking them to court. This is ridiculous. Highly NOT recommended.",
    "star_1": 1,
    "review_2": "I have recently heard that several insurance companies are giving customers rebates, secondary to the covoid 19 pandemic, which has virtually reduced to a minimum travel by cars. Is Norfolk and Dedham also going to do this.? In these hard times, I know I would benefit for this type of reduction in my liabilities.",
    "star_2": 1,
    "review_3": "Worst, the worst of the worst insurance company I have ever used, cheap payments are always the most costly ones in the long run. Just as I am about to finish up my payment, the cancel because of a 3day late payment. I wish you go out of business.",
    "star_3": 2
  },
  "Oklahoma Farmers Union": {
    "name_of_reviewer": "oldman37",
    "review_1": "Nice and attentive to your needs.",
    "star_1": 5,
    "review_2": "I really like them. I had zero problems with them. I only canceled because my car broke down. I’d totally go back to them.",
    "star_2": 5,
    "review_3": "Good rates, good coverage, easy billing. I really like doing business with them. I haven’t had a claim so can’t speak to the claims process.",
    "star_3": 4
  },
  "Georgia Farm Bureau": {
    "name_of_reviewer": "Charlie444",
    "review_1": "Overall, I am satisfied with the auto policy that GA Farm Bureau has provided for us. The only claim that we incurred was for windshield damage immediately after we took the coverage. They paid that claim promptly and helped us handle the repair very efficiently. When we wished to decrease our level of coverage due to the age of the vehicle, the agent we spoke with was helpful if not overly friendly, and he implemented the changes we wanted and reduced our premium accordingly.",
    "star_1": 4,
    "review_2": "Georgia Farm Bureau always goes above and beyond for their customers. The rates are great and the staff are always very helpful and friendly. Love having local agents and office staff that I can talk to in person and that will help with all of our auto insurance needs.",
    "star_2": 5,
    "review_3": "Very nice and good to consumer has very new policies would be aware before commiting to everyting needed.",
    "star_3": 5
  },
  "American Independent": {
    "name_of_reviewer": "Anthony Silver",
    "review_1": "Overcharged by double for a couple of years! No help from the agency... Questioned them when they actually raised the rate in January! Now being hounded with a 58 dollar cancellation fee! Actually contacted by a collection service of all things! Do NOT use an agency connected with Good2Go! I tried Levin... Found arrogance and thievery! No accountability!",
    "star_1": 1,
    "review_2": "Worst company ever . I don’t know how there still in business",
    "star_2": 1,
    "review_3": "I work for a dealership, and one of our post-delivery duties is to contact insurance in order to add the customer’s new vehicle to their current policy. It not only takes at least 1 hour to connect with a human being, they are very rude, and have hung up on us countless times. In the state of Pennsylvania, it is necessary to establish this coverage ASAP, and if the insurer does not allow said action, legal action can be taken. I’d strongly suggest that this company change the way they conduct their business. Their reviews on the BBB are more than telling of how they treat their patrons. I’d give them zero stars if it were possible.",
    "star_3": 1
  },
  "ALFA": {
    "name_of_reviewer": null,
    "review_1": "Postergirl Homeowners insurance review Alfa is a rock-solid company that has embraced the convenience of the internet while keeping that small-town feel.",
    "star_1": 4,
    "review_2": "Car insurance review Alfa has been AMAZING! They have truly treated us like family and made sure we knew about any Benefit our policy included. Our agent has been available 24/7 any time we needed him! Can not say enough great stuff about Alfa! So thankful we found them and made the change!!",
    "star_2": 5,
    "review_3": "alllllt Car insurance review they are a good company. never had a problem. never had to use it yet but im sure if i did they would be there",
    "star_3": 5
  },
  "Mercury": {
    "name_of_reviewer": null,
    "review_1": "price always go up upon every renewal. they always say there are discounts but never truly see it on the policy",
    "star_1": 3,
    "review_2": "I thought that it was really good! If I were to change something, it would probably be the way the guys react on the phone",
    "star_2": null,
    "review_3": null,
    "star_3": null
  },
  "Progressive": {
    "name_of_reviewer": "Regmi333",
    "review_1": "Progressive has been a great company to have insurance with. At first, they gave me a little gadget to plug into my car and it detected my driving skills. I, being the safe driver that i am, was credited with a safe driving discount. And, every so often they will lower my bill for not having any accidents or claims. This is the best Auto Insurance that i have ever had. Thanks Progressive!",
    "star_1": 5,
    "review_2": "I can’t say enough good things about progressive. In the decade I’ve been in a total of 3 not-at-fault accidents, and not only did they take excellent and total care of me and my car from points A to B, my rates weren’t increased due to reckless driving of others. A+ customer service, and for my money, a company with integrity.",
    "star_2": 5,
    "review_3": "It has best value for money. Gives me peace of mind. I had accident 2 months ago. They hello me get through it. Covered my all expenses.",
    "star_3": 5
  },
  "Alliance United": {
    "name_of_reviewer": null,
    "review_1": "pwdocts Car insurance review While I was using it, I did not have any bad experience with it. The only two complains I had with them:\nFirst: it was their convenience charge fee when you were paying with a debit/credit card thru their website. This fee should be paid by them, not for the customers. \nSecond: They did not disclosed the entire policy during the purchasing process. So when I tried to pass it to my rent cars, I realized this isn’t not possible.",
    "star_1": 4,
    "review_2": "Car insurance review Very good! Always reliable and easy to use. Have been using this for many years and have recommended to all my friends and family and everybody loves it",
    "star_2": 4,
    "review_3": "Scottwalt Car insurance review This was a great and easy process with this company I referred to anyone Anytime Anyplace so if you’re looking for a great policy please check this company out you will not be disappointed",
    "star_3": 5
  },
  "Columbia Insurance": {
    "name_of_reviewer": "Moes1",
    "review_1": "Reasonable rates for Auto Insurance.Offer several options too pay your bill. Good customer service services.",
    "star_1": 4,
    "review_2": "For the most part, I have no problems with this company. They have cheap prices and the agent that I go through does most of the work. The bill goes up little by little (about ten dollars more a month then when I started 3 years ago). They also almost dropped me after recording my vin number wrong but wasn’t a huge deal to fix it. Worth it for the cheapest premium.",
    "star_2": 4,
    "review_3": "good company reasonable rates sometimes I do not understand extra charges on bill from time to time. They had a grace period of three days paying your bill than they did away with it I wish they would of kept it. I pay the same amount as I did with Allstate maybe a little less. The customer service center is very good though except for one time I received a rude agent very discourteous.",
    "star_3": 4
  },
  "Allstate": {
    "name_of_reviewer": null,
    "review_1": "Reviewer331 Car insurance review Allstate has reasonable rates and my agent is always available to assist us whenever we need her. Our daughter had an accident and the company did a good job handling payments for the car’s repair. We sometimes have to make a follow up call, but it doesn’t happen often. Our agent usually calls us prior to our renewal date to go over our policy and see if any further discounts are available.",
    "star_1": 4,
    "review_2": "Car insurance review I have been with Allstate for more than 4 years now. I purchased an auto insurance from Allstate back in 2016 & I’ve been with them since then. They have well qualified personnel who are always eager to help their clients through every issues they might face. They are professional, trustworthy & reliable. Good luck to you & God bless.",
    "star_2": 5,
    "review_3": "ABKumar Indicates employee written review Car insurance reviewIt has an awesome experience with All state Insurance Agents. They helped me to get a good policy at reasonable cost .\r\nAlso, they advised on each step so that I can get a reduced insurance rates. Will love to continue with them.",
    "star_3": 5
  },
  "Shelter": {
    "name_of_reviewer": "Broncos1858",
    "review_1": "Shelter has been great. They make sure that whenever there is a wreck that wasn’t your fault they fully take care of it without having adding extra stress contacting and resolving the issue directly with the other’s insurance company.",
    "star_1": 5,
    "review_2": "The policy provided is very easy to understand. The agent was very nice to explain everything to me and helped customize my auto insurance.",
    "star_2": 5,
    "review_3": "Horrible. My brand new 2020 truck got damaged last night! The insurance agent was rude! I can’t even take my truck to get fixed until the adjuster calls me so I am stuck driving around a damaged truck which was no fault of my own!!!",
    "star_3": 1
  },
  "Arbella": {
    "name_of_reviewer": "DMP",
    "review_1": "Someone else cut in front of me and the accident was totally their fault. Arbella was on my side and took care of everything very quickly and gave me top dollar for my truck which was totaled. It was wonderful not to have to chase them and to get my money so quickly.",
    "star_1": 5,
    "review_2": "Always helpful and friendly. Needed to file before and they were out to access car damage within two days. Happy with sevice.",
    "star_2": 5,
    "review_3": "They were a good company and loved using them all the time, however, I had one claim that was huge from a pipe burst that flooded my first floor and destroyed the furnace. They paid the claim, and then just canceled the policy on me. Not a cool thing to do. thankful they paid the claom to have it fixed though.",
    "star_3": 3
  },
  "Iowa Mutual": {
    "name_of_reviewer": "Simon Villa",
    "review_1": "Stay away ...This company is a scam! They raised our rates after my husband received his first speeding ticket in 15 years. They said it would go back down, but it has not. The rates continue to soar and we hadn’t filed a claim in the 7 years with them. That should have been our sign.",
    "star_1": 1,
    "review_2": "Don’t waste your money. They will find any reason not to pay for anything. We share a roof with our neighbor, we are in a Town home and our neighbor received full pay out for a damaged roof and Iowa Mutual adjuster claimed we had no damage. Now our association has to decide what to do. We aren’t going to pay for a new roof out of pocket. That’s why you have insurance. In 2016 we had a claim that they refused to fulfill the replacement of what was damaged. In 47 years we had these 2 claims and 1 in the early nineties that was fully covered by another company. We have cancelled our Insurance with Iowa Mutual.",
    "star_2": 2,
    "review_3": "Quick and rapid fix my car was fixed in 2 day, thanks lowa mutual insurance!",
    "star_3": 5
  },
  "Capital Insurance Group": {
    "name_of_reviewer": "5star69",
    "review_1": "The company is okay on car insurance. When we had a car totaled (was hit by a careless driver), they did not give us the full value of the car. On the home owners side of things, they hired subpar contractors to handle a flood in the house. The contractors actually stole from us and then threatened us. This was a very bad experience. Recently, we had a slight bush in a parking lot that they seemed to handle effectively.",
    "star_1": 2,
    "review_2": "Avoid this insurance. They have charged us fees when paid in full due to the automatically assume you will pay minimum and charge fee for payment plan. They have also misinformed our mortgage company that policy was cancelled even though paid. Now have to deal with mortgage company and their insurance policy that they want to force us to pay for. Very underhanded company and would not recommend. This was the last straw and looking for another company.",
    "star_2": 1,
    "review_3": "I have had good experiences with the company, only one issue which was the zip code. Company took care of it immediately.",
    "star_3": 5
  },
  "Colorado Farm Bureau Mutual": {
    "name_of_reviewer": "Ryan Lownsberry",
    "review_1": "The level of customer service at the office continues to disgust me. I can’t believe that I can call a business with a smile on my face for basic information and leave so frustrated because of the way they choose to interact on the phone. Work on your customer service if you wish to retain customers.",
    "star_1": 1,
    "review_2": "Great customer service!!! Polite, friendly, knowledgable, and LAUREN went ABOVE & BEYOND to ensure we were properly taken care.... TY!!!",
    "star_2": 5,
    "review_3": "Susan Edwards with Farm Bureau is an absolute treasure! She is easy to work with, happy to explain anything that’s confusing, and truly cares about what is best for you. She has saved us time, money, and been our advocate every single time we’ve reached out to her. I wouldn’t recommend looking anywhere else when trying to get the insurance that you need.",
    "star_3": 5
  },
  "Metropolitan": {
    "name_of_reviewer": "Alex_C",
    "review_1": "The MetLife Grandprotect policy is very comprehensive. Their billing is a little screwy however, with the way they apply credits and debits from changes.",
    "star_1": 4,
    "review_2": "We had recently moved to FL from NY and found it challenging to find an insurance company that would fit our needs. We had attempted to bundle it with our homeowners policy, but found it would cost us more than having single policies! We contacted Metropolitan in NY and they wrote our FL policy with no problem and have been our carrier since.",
    "star_2": 5,
    "review_3": "This company is by far the best. It has a great price and the customer service is outstanding! I went through many companies trying to find the best price and this was it!!",
    "star_3": 5
  },
  "Direct General Insurance": {
    "name_of_reviewer": "bamachik79",
    "review_1": "their rates are cheap and the website is easy to use. the price I was quoted is the price I pay. Ive never had a problem in the two years ive been with them.",
    "star_1": 5,
    "review_2": "I have been with Direct general for past 3 years, when i was looking for insurance, there were the cheapest but every 6 months the Auto insurance rates goes up. Now i am thinking of changing it. Never been in an accident, so not sure if their claim process works smoothly",
    "star_2": 3,
    "review_3": "Rates are lower for us than any other Legitimate company that I have found. If you pay your insurance by the month, the only way not to be charged a \"convenience\" fee is to call and pay the bill through the automated service with a debit/credit card. I found that to be easiest for me before I started paying for a whole year at a time. I’ve never had to file a claim as of yet so I can’t comment on that. If you are looking for a cheap easy insurance company to fulfill state requirements this one definitely works for that purpose.",
    "star_3": 4
  },
  "Virginia Farm Bureau": {
    "name_of_reviewer": "ACPhillips",
    "review_1": "They are absolutely a great company! The best insurance company ever who put customers first. A+++++",
    "star_1": 5,
    "review_2": "This company offers good insurance at a good price. We have had two accidents in the past few years, one our fault and one someone else, and they have treated very well both times. We feel they are fair and honest. They process payment quickly. We would not consider changing companies.",
    "star_2": 5,
    "review_3": "Our agent at Farm Bureau is amazing. He is always looking at new ways we can save money and keeping us up to date on the changes happening in Farm Bureau. He looks out for our best interests and is 100% honest. We have changed our auto insurance recently because of the deals we have had through Farm Bureau. I highly recommend this insurance company",
    "star_3": 5
  },
  "Buckeye Insurance Group": {
    "name_of_reviewer": "dadwar",
    "review_1": "They are extremely helpful, answer all questions and provide great guidance and assistance. They provide great coverage and I barely pay for anything.",
    "star_1": 5,
    "review_2": "I like Buckeye a lot. Very helpful.. they have awesome loyalty rewards and they are very understanding.",
    "star_2": 3,
    "review_3": "Affordable and paid claims in timely fashion. Called and spoke to claims rep and submitted claim. Approved and paid within 2 weeks.",
    "star_3": "2020-05-03T21:00:00.000Z"
  },
  "Farmers": {
    "name_of_reviewer": "belonte",
    "review_1": "They gave me a comparative rate to what I had before. The coverage is the same as State Farm but the deductible is lower. Having the auto insurance with Farmers gave us a great discount on the Farm & Ranch (Homeowner’s Insurance) policy we needed to be able to sell at the farmers markets. Now we are covered across the board!",
    "star_1": 5,
    "review_2": "Great policies, great policyholders, has good benefits, better than any companies I did business with prior, I would definitely recommend",
    "star_2": 5,
    "review_3": "the policy was pretty efficient, Once i was in an accident and farmers covered the whole thing. Their premiums are high but not unexpected but their service is good.",
    "star_3": 4
  },
  "Southern Farm Bureau": {
    "name_of_reviewer": "Mallie",
    "review_1": "They have always been fast with claims and easy to deal with. Have always took care of what I needed.",
    "star_1": 5,
    "review_2": "Great experience! They are so helpful and the agents really put forth the effort to make sure you are well taken care of.",
    "star_2": 5,
    "review_3": "Thankfully, no claim has been made but any questions ever asked about insurance is always handled in professional manner.",
    "star_3": 5
  },
  "Southern Ins Co of Virginia": {
    "name_of_reviewer": null,
    "review_1": "They have great coverage at low premiums. The company sends out useful information via email. We haven’t had to use it, thank the Lord!",
    "star_1": 5,
    "review_2": "Our claims have always been handled quickly and efficiently. Reimbursement for car seats has been prompt, as have reimbursements for medical expenses.",
    "star_2": 5,
    "review_3": null,
    "star_3": null
  },
  "Pioneer State Mutual": {
    "name_of_reviewer": "realestaroundg",
    "review_1": "This company has the lowest price compared to all others in Michigan. They were very easy to file a claim and they sent an agent out quickly.",
    "star_1": 3,
    "review_2": "so far so could I have no claims ever but my bill keeps going up if you never had a claim or accident I would think the bill would go down",
    "star_2": 3,
    "review_3": "I REALLY LOVE THIS COMPANY THEY WORK WITH YOU AND SAVE YOU THE HIGHEST AMOUNT OF CASH I LOVE THEM!!!",
    "star_3": 5
  },
  "Utica National": {
    "name_of_reviewer": "DNM49",
    "review_1": "This company is easy to work with and they provided me with a nice discount for bundling my homeowners and auto insurance. I have a \"newish\" driver and they offered me the best rates.",
    "star_1": 5,
    "review_2": "I have had a great experience with this company so far. Great prices, lowest price that my agent could find and I am able to bundle the home and auto insurance. I have not had to submit a claim yet; therefore, I cannot comment on the claims process. Website is easy to use to review policy information and make payments.",
    "star_2": 4,
    "review_3": "I have had a good response with claims and the cost beats other carriers by about half. My local agent has been helpful with any changes that I make. Beats nationally advertised companies.",
    "star_3": 5
  },
  "Pure Companies Grp": {
    "name_of_reviewer": "zro",
    "review_1": "This company was recommended by our Agent and mainly writes insurance in Florida. It is not well-known\r\nin the Northeast. They are one of the few which handles High Value Home Insurance. Automobile Insurance through them is not well-priced",
    "star_1": 4,
    "review_2": "Pure is client centered and offers competitive rates when packaging car and home insurance. Agents are responsive. Annual credits apply.",
    "star_2": 4,
    "review_3": "DO NOT USE THIS COMPANY...They are cancelling our home insurance after 6 years due to 2 claims (both small). This is totally absurd and a ridiculous outcome. They act like they are in the business of caring for you but they couldn’t care less. use at your own peril",
    "star_3": 3
  },
  "New York Central Mutual": {
    "name_of_reviewer": "billie9237",
    "review_1": "this is a company that provides top class services in New York city. I am very satisfied with this insurance company.",
    "star_1": 5,
    "review_2": "Good company to work with and helpful/knowledgeable customer service. They provide their bills on time and good communication",
    "star_2": 5,
    "review_3": "I love this company the agents are great nice kind and courteous and I searched among all the other insurance companies for the cheapest price",
    "star_3": 5
  },
  "Texas Farm Bureau": {
    "name_of_reviewer": "Lindsey1",
    "review_1": "This is a great insurance company that I have been with a long time. It has been good to me and I will continue to use it",
    "star_1": 5,
    "review_2": "Lacking customer service skills with agent and staff. Not accommodating to long term clients. Promises made for premiums and coverage that they could not guarantee and honor. Misleading gestures and promises made. Not trustworthy.",
    "star_2": 1,
    "review_3": "Texas Farm Bureau provides a good coverage with competitive rates.. I have both auto and home owners and have had no issues when I had an auto claim. Fortunately, I haven’t had to use the home owners as of this date.",
    "star_3": 4
  },
  "Travelers": {
    "name_of_reviewer": "Vgjimenez",
    "review_1": "Travelers is an excellent company. I used their service for over 15 years. Nothing but top notch customer service every time I needed to speak with them",
    "star_1": 5,
    "review_2": "Flawless claim and credit with this insurance company after I got into an accident. Excellent Customer service",
    "star_2": 5,
    "review_3": "Travelers is a great auto insurance to have. They were helpful when I was in a car accident (not at fault). They made sure I was taken care of.",
    "star_3": 5
  },
  "United Automobile": {
    "name_of_reviewer": "sbrivera06",
    "review_1": "United Auto Insurance is very affordable. They have plans to meet everyone’s needs. I haven’t had to file any claims, so I’m not sure how their customer service is. They do send out a lot of mail, which is why I docked them half a star, but other than that so far so good.",
    "star_1": 5,
    "review_2": "It is very affordable. The only down fall is that you have to email the company for everything. It is not user friendly.",
    "star_2": 5,
    "review_3": "I called to pay my bill of $400 and they said it wasn’t allowing them to charge me to call the next day and it wouldn’t go up, surely when I called the next day it was $440 . HORRIBLE company with fake promises . They don’t value customers",
    "star_3": 1
  },
  "Quincy Mutual": {
    "name_of_reviewer": "woodsey26",
    "review_1": "Very easy to pay my car insurance bill online! It had listed all of the steps and it was very simple. It took me a matter of seconds to complete it.",
    "star_1": 5,
    "review_2": "I have been using auto insurance supplied by this company for 10 plus years and have nothing but good things to say about them. When dealing with a representative they are always pleasant, well spoken, and helpful.",
    "star_2": 5,
    "review_3": "quick claims and easy claims. we had to submit a claim once and the process was very easy and smooth.",
    "star_3": 4
  },
  "Peerless Insurance Company": {
    "name_of_reviewer": "dcgcwc",
    "review_1": "Very good to work with, had a little fender bender with the ex wife in her driveway but they made it all very smooth and handled everything for me. I really like this company.",
    "star_1": 5,
    "review_2": "Company saved me four hundred dollars a year! They provide fantastic coverage and make it incredibly easy to pay your bill",
    "star_2": 5,
    "review_3": "Peerless has always provided prompt and efficient service. Their prices are competitive and the service is very reliable.",
    "star_3": 5
  },
  "MO Farm Bureau Services": {
    "name_of_reviewer": "Jenniferjill85",
    "review_1": "Very helpful when filing a claim. Was quick to respond to my needs. Paid right away. Friendly personnel.",
    "star_1": 5,
    "review_2": "My local agent is a nice individual. The two claims I have had to file in nearly 20 years were turned around quickly in a satisfactory way.",
    "star_2": 5,
    "review_3": "We were shopping around for auto insurance since we were purchasing another vehicle and our current insurance company quated us something we just couldn’t afford. Missouri farm bureau not only has incredible customer service but they were able to get too cars and renters insurance for WAY less than what we were paying for just the one car alonr at another company.",
    "star_3": 5
  },
  "Kentucky Farm Bureau": {
    "name_of_reviewer": "JFMK",
    "review_1": "We have had all our insurance with Ky Farm Burea for many years. My husband has comparison priced other insurance companies before but still couldn’t find any better. They are always friendly and easy to deal with",
    "star_1": 5,
    "review_2": "The worse insurance company of all time. Very rude and disrespectful. Did not stand up on there side of the contract",
    "star_2": 1,
    "review_3": "Love this company! Family feel and great customer service. They have been a staple in our family for years.",
    "star_3": 5
  },
  "Unigard": {
    "name_of_reviewer": null,
    "review_1": "We have homeowners (2 homes), rental, 3 autos, and umbrella policies with Unigard. Unigard has been excellent for it all!!",
    "star_1": 5,
    "review_2": null,
    "star_2": null,
    "review_3": null,
    "star_3": null
  },
  "Western Reserve": {
    "name_of_reviewer": "jgirl09",
    "review_1": "We have never had any troubles with Western Reserve. We had one claim when our son was in a minor accident, and another when someone else backed into me. They were reasonable to work with both times, and paid according to the policy. The payment wasn’t quick, but again, it was reasonable and was what we expected.",
    "star_1": 4,
    "review_2": "They have been great to work with so far! The price is much lower than what we were paying with our previous provide",
    "star_2": 5,
    "review_3": "To be honest, they made shopping for auto insurance easy and manageable for a first-time buyer. I plan on staying with them for a long, long time",
    "star_3": 5
  },
  "Farmers Mutual of Nebraska": {
    "name_of_reviewer": "msvitak1",
    "review_1": "We have our auto insurance through them, as well. We have been more than satisfied, especially when we were in a horrible accident. The accident was not our fault, but our vehicle was totaled. The other insurance agency was not cooperating with us in regards of which rental vehicle type we wanted, so our insurance company took over. They got us the rental we wanted, and said they would go after the insurance company for reimbursement. They checked on us after the accident, as well, to see how everyone was healing up. The workers went above and beyond!",
    "star_1": 5,
    "review_2": "They were good, really nice customer service. There was really no problems other than a bit of space for improvement.",
    "star_2": 4,
    "review_3": "They were very helpful when we had a claim during some storm damage we had a few years ago. Our agent was responsive and kept us in the loop on details of our policy as they changed and would invite us to review our policy every year. We switched companies after our agent left, because we were no longer hearing from anyone about our policy.",
    "star_3": 4
  },
  "Hastings Mutual": {
    "name_of_reviewer": "SarahE",
    "review_1": "We recently had to file a claim because we had a burst water pipe that caused significant damage to our basement. They have done a nice job of covering everything that was damaged. Communication has been a little slow and lacking, but all in all we are pleased that we are going to get everything returned to normal.",
    "star_1": 4,
    "review_2": "Hastings Mutual has been great to work with every time we have had a claim - from being hit by a car and our truck being totaled to hitting a deer.",
    "star_2": 5,
    "review_3": "If I could give zero stars I would. After a traumatic car accident in which I was sitting parked at a light and was hit out of no where by a car going 45 MPH I was shaken up. It was my first experience filing an insurance claim, and ever level was a nightmare. I currently no longer have Hastings Mutual as my insurance carrier, and I was not going to leave a bad review, because in the end my claim got paid, but going through my old emails I was just astounded at the ineptitude, rudeness, condescension, and complete lack of compassion I experience. I would full recommend that if you have Hastings Mutual you switch before you have to deal with the claims process. You might expect a higher level of service from a smaller company like this, but think again. No one will ever answer when you call, they appear to leave the office about 15 minutes early. The claims representatives, at least the 2 that I worked with are not helpful in the slightest (particularly one \" [REDACTED NAME] Messenger\"). It took 4 months for me to get the claim paid, due to poor communication. I asked to be switched to a different claims representative multiple times and was ignored. I could go on and on, but they made a horrible, stressful situation even worse. I had been a customer for 16 years, and I regret every penny I paid to them. When I contrasted my experience with the experience my mom had filing a claim last year with a larger insurance company I immediately switched.",
    "star_3": 1
  },
  "Donegal Mutual": {
    "name_of_reviewer": "meganosimp",
    "review_1": "We were moving into a new house, and our old insurance company refused to cover us because the roof on our new house was 30 years old. We have been with them 11 years. They said they were going to look into if they could give us a time frame to get the roof redone, but still cover us in the meantime. They never even called back. Not only did Donegal Mutual cover us, they gave us a lower rate than our old company. They also gave us up to two years to get the roof replaced. Great company!",
    "star_1": 5,
    "review_2": "Great experience thus far with this company. This was the best quote we received, and we have had no issues since acquiring this policy.",
    "star_2": 5,
    "review_3": "Relatively easy company to work. Was very responsive when I was in an accident. Turnaround time was good.",
    "star_3": 4
  },
  "Hartford": {
    "name_of_reviewer": "MamaG2",
    "review_1": "We were paying quite a large amount of money on car Insurance for 3 cars. My husband got tired of it and started searching diligently for a better price. He came across Hartford and was quoted a price that he couldnt resist. We switched over to them and have been happy with their prices ever since.",
    "star_1": 5,
    "review_2": "I pay less money through The Hartford insurance company than i would else where, i get all the good discounts and even the discounts through AARP",
    "star_2": 4,
    "review_3": "I have been a customer of The Hartford for approximately 6 years now. I am very happy with their customer service and have not had any problems communicating with them. Their prices are competitive with other insurance carriers.",
    "star_3": 5
  },
  "MEEMIC": {
    "name_of_reviewer": "jodisturk",
    "review_1": "We’ve been with MEEMIC for 18 years now. They have been great with our car insurance. We switched to them after buying a new vehicle and found our old insurance company was going to charge us double for our new car. I started to ask around to friends about their insurance company and a friend recommended MEEMIC to us. The rates for the same vehicle were half the price! We could not believe the difference between the two companies. We had moved to Michigan two years before this from Illinois, where car insurance is very different, they do not have no fault insurance like Michigan does. So we were very surprised at how expensive car insurance was in Michigan. \n\nHowever, with MEEMIC we have been able to bundle our car and homeowners insurance and receive a discount. We also have received discounts over the years for various other things on our homeowners insurance.",
    "star_1": 5,
    "review_2": "SCAM, BEWARE. I cancelled my policy MONTHS ago and they continue to steal $800 per month from me. Takes weeks for them to return it because I have to prove THEM that i had enough $ in my account for them to take it. Incompetent idiods...",
    "star_2": 1,
    "review_3": "Meemic has been fantastic with providing insurance for my family. They are always friendly and warm, and they always keep in touch. I feel happy to be a part of this insurance company.",
    "star_3": 5
  },
  "Mutual Enumclaw": {
    "name_of_reviewer": "bryku",
    "review_1": "Well made. Loved it. Insurance is a very key and important factor when getting a car. It really is helpful.",
    "star_1": 5,
    "review_2": "Love the coverage for the price! Tremendous company that I will happily associate with for the foreseeable future!",
    "star_2": 5,
    "review_3": "I no longer live in an area where Mutual of Enumclaw offers coverage but if I did, I’d definitely still be with them. They are the only insurance company I’ve ever worked with that I felt really honestly cared about me and my family. When we had a horrible accident, they didn’t try to haggle with me at all. They paid out the full limits of the policy. I’ve had several other auto insurance companies over the years and have always felt like I was just a rounding error with the other companies.",
    "star_3": 5
  },
  "GEICO": {
    "name_of_reviewer": "mark126",
    "review_1": "When I first signed up with Geico, I was a bit skeptical but really wanted to save money on my auto insurance. Now, several years later, I am really glad and feel very positive about my decision in selecting Geico. Not only did they promptly help me get my windshield fixed after a huge rock chip happened, but just a few years ago, they took care of a claim when a deer had run out in front of my car. Geico took care of these two claims very promptly and professionally - making sure that I was a satisfied customer during the whole process. I could be more satisfied.",
    "star_1": 5,
    "review_2": "No problems . have been with Geico for about a year and haven’t had any problems. Company seems to handle business properly.",
    "star_2": 5,
    "review_3": "its very good company ..i would like to stay with it ...and i like their respect..they did everything to make me always with them",
    "star_3": 5
  },
  "Pekin Insurance": {
    "name_of_reviewer": "RickSanchez",
    "review_1": "Worst company on the planet. DO NOT use them. Affiliated with Farmers. I had 20 years experience with these jokers. DO NOT waste your time. Difficult to work with and while their rates may be OK they are about as inflexible as they can be. Their billing system is an absolute nightmare. Lip service till you can’t take it anymore. You have been warned.",
    "star_1": 1,
    "review_2": "We had a bad hail storm in our neighborhood called Pekin They sent out injuster in few days\r\nThey were very kind and agreed with the damage very reasonable check came right away",
    "star_2": 5,
    "review_3": "Very lackadaisical company with my experience with them. After I had my auto accident, my license became suspended as they never sent a form of compliance to the BMV (which also resulted in a fine having to be paid). It has taken a month since my license has been suspended for them to even initiate the form of compliance with the BMV. Now I will be unable to travel home to my family for Thanksgiving because of the laziness within the company. I am not happy to say the least, and would advise potential customers to take their business elsewhere.",
    "star_3": 1
  },
  "Hallmark": {
    "name_of_reviewer": "SUZIEQ ISSUEZ",
    "review_1": "worst insurance company my car was damaged by the tornado in October and its December the year is over and i still don’t have my car if i could;d 0 stars !!!!!!!!!!!!!!",
    "star_1": 1,
    "review_2": "If you want an amazing insurance company, this is it! I was hit by one of their clients in Oct 2018. Took my car to get fixed and had to pay cash to get it back because they only paid 600 off the 2000 claim. Your premiums won’t go up because they don’t pay claims. Definitely sign up with these guys.",
    "star_2": 1,
    "review_3": "If you have had issues with this company please report them to the Federal Trade Commission. They need to be investigated on a federal level! Cynthia Buckholz and Jamie Dupree are complete failures at their jobs. They disregarded all of the evidence that was provided to them and are guilty of a Bad Faith Claim. I have provided over 25 minutes of videos, 35+ photos, and security footage of the damage their insured caused to my vehicle and they blamed it on the age of my car. STEER clear of this company and their employees. The managers and staff do not care about investigating claims to the fullest extent and they feel like they don’t have to provide a claim outcome based on the evidence that is provided to them. I am currently escalating above Cynthia and Jamie to try and speak with a staff member who can perform a proper investigation. Official complaints against this company, Cynthia Buckholz, and Jamie Dupree have been filed with the FTC and BBB.",
    "star_3": 1
  },
  "Plymouth Rock": {
    "name_of_reviewer": "Angelina2004",
    "review_1": "Worst insurance company, they denied my hit and run claims, after been a full coverage customer for more than 3 years, don’t be fooled by the cheap prices they offer",
    "star_1": 1,
    "review_2": "Overall it’s been a good experience over the years. Any time there is an issue it is resolved in a prompt, courteous manner",
    "star_2": 3,
    "review_3": "I love this company they work with you if you don’t have the full payment.theyre so friendly and helpful",
    "star_3": 5
  },
  "IMT Insurance": {
    "name_of_reviewer": "MrsR",
    "review_1": "You don’t think you will ever need to file a claim for being robbed but it happens. IMT was on the ball and had an adjuster out to us the next day. She guided us through the process and took care of all the filings that were needed. IMT called and was in contact with us throughout. I have been with them for over ten years now, before that I would change agencies every two/three years.",
    "star_1": "2020-05-03T21:00:00.000Z",
    "review_2": "My experience with IMT insurance was outstanding. On January 3, 2020, my husband hit a deer and our car was totaled. We had full reimbursement for our towing bill, which we had to pay to the towing company (another bad story) before our car could be released and the check for our car on January 13, 2020. [REDACTED NAME] Bean was our adjuster and he was awesome in getting everything organized and getting us our reimbursement.",
    "star_2": 5,
    "review_3": "Decent company to work with. Works well with us on payments and claims. Local agent. Coverage is great.",
    "star_3": 5
  },
  "Home State Ins Group": {
    "name_of_reviewer": "mayesgr",
    "review_1": "Recently had an accident and was handled quickly and with care. Very quick settlement despite accident happening right before Thanksgiving.",
    "star_1": 5,
    "review_2": "I got to know about this while i decided to visit directly to the company and there the agents explained me well.",
    "star_2": 5,
    "review_3": "Aig is a well established insurance company with a long history they have good agents and low quotes the only problem i got was rate increase a year ago but i figured it out with my agent",
    "star_3": 4
  },
  "AIG": {
    "name_of_reviewer": "johwya",
    "review_1": "They sell flight insurance through AON that they then refuse to cover. Disgusting scam! But if you want to throw your money away ...\r\nAt least with life insurance you don’t have to worry about them not paying up after you’re dead! Those you’re buying the insurance for might - they will find a loophole.",
    "star_1": 1,
    "review_2": "All in all good. They are very good by providing customer service. And important thing is they are trustworthy.",
    "star_2": 5,
    "review_3": "Great customer service, was easy to deal with when I got in a wreck and needed my car repaired. The agent called us back in a timely manner and was happy to help with any of our questions.",
    "star_3": 4
  },
  "Central Insurance": {
    "name_of_reviewer": "billie9237",
    "review_1": "this is a company that provides top class services in New York city. I am very satisfied with this insurance company.",
    "star_1": 5,
    "review_2": "Good company to work with and helpful/knowledgeable customer service. They provide their bills on time and good communication",
    "star_2": 5,
    "review_3": "I love this company the agents are great nice kind and courteous and I searched among all the other insurance companies for the cheapest price",
    "star_3": 5
  },
  "Maryland Auto": {
    "name_of_reviewer": null,
    "review_1": "Great prices, payment options, different payment plans... no credit check .. I love this company its definitely dedicated to affordable quality insurance for just regular people like my family and I...",
    "star_1": 3,
    "review_2": null,
    "star_2": null,
    "review_3": null,
    "star_3": null
  },
  "Preferred Mutual": {
    "name_of_reviewer": "Brhclear",
    "review_1": "Very helpful agents. They are easy to get a hold of when you need to contact them. They have very competitive rates as well.",
    "star_1": 5,
    "review_2": "i really like this insurance company because they always tell me that i am never late and they always sent me a remind messages bout when i need to pay it and email me when i pay it,,but i really love it the insurance ..i always count on them...thank you from being a great insurance company..",
    "star_2": 5,
    "review_3": "Have been with them for 5 years. Despite a costly claim and a minor one they didn’t drop me. Though I’m paying more I appreciate that I can stay with them",
    "star_3": 5
  },
  "Hanover": {
    "name_of_reviewer": "LadyArchitek",
    "review_1": "I have had auto and home insurance with Hanover for many years. They have always been excellent to deal with. They do an analysis annually to make sure my coverage is up to date and the lowest cost it can be. More than once they have called to tell me I can lower my premium by making certain changes.",
    "star_1": 5,
    "review_2": "Very fair pricing and coverage. \r\nCustomer Service is very easy to deal with.\r\nEasy to understand invoicing and flexible payment schedule.",
    "star_2": 5,
    "review_3": "Our claims have been easy to report. Our claims have not had any hassles and every in claims have been polite and easy to deal with.",
    "star_3": 5
  },
  "Loya Insurance": {
    "name_of_reviewer": "Jennjenn",
    "review_1": "They’re fantastic! Customer service is on point and they talk to you like a person. It’s not scripted.",
    "star_1": 5,
    "review_2": "They have cheap policies and their premiums go down pretty fast. But their agents dealing with claims are some of the worst I have ever had. I went days without hearing from the agent, even customer service could not get ahold of them. If you want to save money they are a good option, just hope you never have to claim anything.",
    "star_2": 2,
    "review_3": "Very friendly staff but not very knowledgeable. I seemed to know more about my own question than any of the staff at the office did for me.",
    "star_3": 4
  }
}
